import random
###--------------------------------------------------------------------
# Напишите программу, удаляющую из текста все слова, содержащие ""абв""
###--------------------------------------------------------------------

# text = 'Привет забвение мое'.split(' ')
# substr = "абв"
# newstr = list(filter(lambda text: substr not in text, text))
# print(newstr)

###--------------------------------------------------------------------
# 2.Создайте программу для игры с конфетами человек против человека.
# Условие задачи: На столе лежит 2021 конфета. Играют два игрока делая ход друг после друга.
# Первый ход определяется жеребьёвкой. За один ход можно забрать не более чем 28 конфет.
# Все конфеты оппонента достаются сделавшему последний ход.
# Сколько конфет нужно взять первому игроку, чтобы забрать все конфеты у своего конкурента?
# a) Добавьте игру против бота
# b) Подумайте как наделить бота "интеллектом"
###--------------------------------------------------------------------

# while True:
#     bot = int(input('Играем против бота или другого игрока (1 или 2) = '))
#     n = 221
#     ran = random.randint(1, 2)
#     if bot == 1:  # Бот
#         print('Превым ходит 1-человек или 2-бот. Рандом выбрал: ' + str(ran))
#         while n > 0:
#             print('Осталось конфет: ' + str(n))
#             if (ran == 1):
#                 n -= int(input('1 игрок: Введите сколько конфет возьмете: '))
#                 if n <= 0:
#                     print('Победил игрок ' + str(ran))
#                 ran = 2
#             elif (ran == 2):
#                 if n > 57:
#                     n -= random.randint(1, 28)
#                 elif 29 < n <= 57:
#                     n -= n - 29
#                 elif n == 29:
#                     n -= random.randint(1, 28)
#                 else:
#                     n -= n
#                 if n <= 0:
#                     print('Победил игрок ' + str(ran))
#                 ran = 1
#     elif bot == 2:  # 2 игрока
#         while n > 0:
#             print('Осталось конфет: ' + str(n))
#             if (ran == 1):
#                 n -= int(input('1 игрок: Введите сколько конфет возьмете: '))
#                 if n <= 0:
#                     print('Победил игрок ' + str(ran))
#                 ran = 2
#             elif (ran == 2):
#                 n -= int(input('2 игрок: Введите сколько конфет возьмете: '))
#                 if n <= 0:
#                     print('Победил игрок ' + str(ran))
#                 ran = 1
#     else:
#         print('Введите правильное значение')
#     if int(input('Продолжаем? 1-да 2-нет ==> ')) == 2:
#         break


###--------------------------------------------------------------------
# 3.	Создайте программу для игры в "Крестики-нолики".
###--------------------------------------------------------------------

# array2 = [["1", "2", "3"],
#           ["4", "5", "6"],
#           ["7", "8", "9"]]
#
# def print_mas():
#     for mas_str in array2:
#         for elem in mas_str:
#             print(elem, end=" ")
#         print()
#
# def cls():
#     print("\n" * 100)
#
# str1 = lambda: array2[0][0] + array2[0][1] + array2[0][2]
# str2 = lambda: array2[1][0] + array2[1][1] + array2[1][2]
# str3 = lambda: array2[2][0] + array2[2][1] + array2[2][2]
#
# row1 = lambda: array2[0][0] + array2[1][0] + array2[2][0]
# row2 = lambda: array2[0][1] + array2[1][1] + array2[2][1]
# row3 = lambda: array2[0][2] + array2[1][2] + array2[2][2]
#
# dig1 = lambda: array2[0][0] + array2[1][1] + array2[2][2]
# dig2 = lambda: array2[0][2] + array2[1][1] + array2[2][0]
#
# f = lambda: [str1(), str2(), str3(), row1(), row2(), row3(), dig1(), dig2()]
#
# n = 0
# print_mas()
# while "xxx" not in f() and "ooo" not in f() and n < 9:
#
#     if n % 2 == 0:
#         x = int(input("Игрок 1 введите позицию для крестика")) - 1
#         array2[x // 3][x % 3] = "x"
#     else:
#         x = int(input("Игрок 2 введите позицию для нолика")) - 1
#         array2[x // 3][x % 3] = "o"
#     n += 1
#     if "xxx" in f():
#         print("Победил первый игрок")
#     elif "ooo" in f():
#         print("Победил второй игрок")
#     elif n == 9:
#         print("Ничья")
#     print_mas()

###--------------------------------------------------------------------
# 4.	Реализуйте RLE алгоритм: реализуйте модуль сжатия и восстановления данных.
###--------------------------------------------------------------------

# with open('input01.txt', 'r') as f_i1, open('input02.txt', 'w') as f_i2, open('output.txt', 'w') as f_o:
#     sl = []
#     strk = f_i1.read()
#     str1 = ""
#     i = ""
#     str2=""
#     prev_elem = 0
#     for elem in strk:
#         if elem != prev_elem:
#             sl.append([elem,1])
#             prev_elem = elem
#         else:
#             sl[len(sl)-1][1] +=1
#     for item in sl:
#         str1 += str(item[1]) + item[0]
#     f_i2.write(str1)
#
#     for j in range(len(str1)):
#         if str1[j].isdigit():
#             i += str1[j]
#         elif len(i) != 0:
#             str2 += int(i)*str1[j]
#             i=""
#     f_o.write(str2)

